// Задание 1
// Создайте массив arr, который содержит числовые значения.

// Добавьте этому массиву, в начало, элементы: 4, 5, 6. Вывести результат в консоль.

// К примеру, если в перемнной arr хранится массив: [1,2,3]

// То в выводе получим:

// [4,5,6,1,2,3]

// Задание 2
// Создайте массив arr, принимающий в себя данные: ['js', 'css', 'jq'].

// Выведите на экран первый элемент при помощи метода массива:

// js

// Задание 3
// Создайте массив переменную arr, в которой хранится данный массив - ['js', 'css', 'jq'] .

// Выведите на экран последний элемент при помощи метода массива.

// Вывод будет:

// jq

// Задание 4
// Создйте переменную arr, в которой хранится массив [5, 2, 4, 2, 7] . С помощью метода slice, запишите в новую переменную первые 3 элемента из массива arr.

// Вывести результат в консоль.

// Вывод будет:

// [5, 2, 4]

// Задание 5
// Создайте переменную arr, в которой хранится массив:

// [3, 4, 1, 2, 7]

// Отсортируйте массив по возрастанию при помощи метода массива.

// Вывести результат в консоль.

// Вывод в консоль должен быть:

// [1, 2, 3, 4, 7]

// Задание 6
// Создайте массив arr и присвойте ей числовое значение.

// С помощью метода splice запишите в новый массив элементы, под первым, вторым и третьим индексом в массиве.

// Вывести результат в консоль.

// К примеру если в arr: [1, 2, 3, 4, 5], то в новом массиве будут элементы:

// [2, 3, 4]

// Задание 7
// Создайте массив в переменную arr, отсортируйте данный массив по убыванию.

// Вывести результат в консоль.

// Если в arr передали массив - [5, 2, 1, -10, 8]

// то вывод должен быть:

// [8, 5, 2, 1, -10]

// Задание 8
// Создайте массив arr, в которой хранятся строки.

// В начале, вывести в консоль самое длинное слово из массива, затем упорядочить массив по убыванию (по количеству символов) и вывести упорядоченный массив во втором console.log.

// К примеру если в arr передали:

// ["Apple", "Orange", "Banana", "Pineapple", "Cherry"]
// Вывод будет:

// Pineapple
// ["Pineapple", "Orange", "Banana", "Cherry", "Apple"]
// первым в консоль вывели самую длинную строку - 'Pineapple', затем сам упорядоченный массив

// Подсказка: у строк есть свойство возвращающее длину строки -length

// Задание 9
// Создайте массив из чисел arr. Вывести в консоль наибольшее число из массива.

// К примеру, если в arr попадет массив [0, -11, 121, 3, 18]

// Вывод должен быть:

// 121

// Задание 10
// Создайте переменную arr, в которой массив ['Джаз', 'Блюз']

// let arr = ['Джаз', 'Блюз'];
// Массив изменяйте с помощью методов массива, таких как push, shift, splice, unshift. Давайте проведём 6 операций с массивом:

// Добавьте строку 'Рок-н-ролл' в конец массива arr:
// ['Джаз', 'Блюз', 'Рок-н-ролл']
// Замените значение в середине на «Классика». Ваш код для поиска значения в середине должен работать для массивов с любой длиной:
// ['Джаз', 'Классика', 'Рок-н-ролл']
// Удалите первый элемент массива и покажите его.
// ['Классика', 'Рок-н-ролл']
// Джаз
// Вставьте «Рэп» и «Регги» в начало массива.
// ['Рэп', 'Регги', 'Классика', 'Рок-н-ролл']
// Выведите результат в консоль.
// ВАЖНО! Очистите код от лишних console.log() если они не требуются по условию задания.

// Задание 11
// Создайте переменную arr, в которой хранится массив вида:

// ["Life", "is", "hard"]
// С помощью метода splice замените слово "hard" на "good".

// Вывести результат в консоль.

// Результат должен быть:

// ["Life", "is", "good"]

// Задание 12
// Создайте массив arr. Переверните массив и выведите его в консоли.

// К примеру если в arr у нас такой массив: [1,2,3,4]

// то вывод будет таким:

// [4,3,2,1]
// Используйте метод reverse

// Задание 13
// Создайте переменную arr, в которой хранится массив вида:

//  ["один","два","три","четыре"]
// Используя методы splice и push, напишите код, который переставляет первый элемент массива в конец исходного массива.

// Вывести результат в консоль.

// Пример ввода:

//  ["один","два","три","четыре"]
// Пример вывода:

//  ["два","три","четыре","один"]

//  Задание 14
// Создайте переменную arr, в которой хранится массив вида:

//  ["один","два","три","четыре"]
// Используя метод join, напишите код, который объединяет все элементы массива в строку. Между словами должен быть знак +.

// Вывести результат в консоль.

// Пример ввода:

//  ["один","два","три","четыре"]
// Пример вывода:

//  "один+два+три+четыре"

// Задание 15
// Создайте переменную arr, в которой хранится массив вида:
//  [11, 4, 6]
// Используя метод slice(), от первого элемента массива отнимите второй, результат занесите в конец исходного массива.
// Вывести результат в консоль.
// Пример ввода:
//  [11, 4, 6]
// Пример вывода:
//  [11, 4, 6, 7]

// Задание 16
// Создайте 2 массива arr1, arr2. Объедините их вместе. Выведите объедененный массив в консоль.
// Например:

// let arr1 = [1,2,3]
// let arr2 = [4,5,6]
// Вывод:

// [1,2,3,4,5,6]

// Задание 17
// Создайте массив arr. Выведите в консоль массив, где элементы в обратном порядке
// Например:

// let arr = [1,2,3]
// Вывод:

// [3,2,1]

// Задание 18
// Создайте массив arr. Добавьте ему в конец элементы 4, 5, 6. Выведите в консоль измененный массив
// Например:

// let arr = [1,2,3]
// Вывод:

// [1,2,3,4,5,6]

// Задание 19
// Создайте массив arr. Добавьте ему в начало элементы 4, 5, 6. Выведите в консоль измененный массив
// Например:

// let arr = [1,2,3]
// Вывод:

// [4,5,6,1,2,3]

// Задание 20
// Создайте массив arr. Удалите первый элемент и выведите его в консоль.
// Например:

// let arr = [1,2,3]
// Вывод:

// 1

// Задание 21
// Создайте массив arr. Удалите последний элемент и выведите его в консоль.
// Например:

// let arr = [1,2,3]
// Вывод:

// 3

// Задание 22
// Создайте массив arr. Удалите из массива 2 и 3 элемент. Выведите измененный массив.
// Например:

// let arr = [1, 2, 3, 4, 5]
// Вывод:

// [1, 4, 5]

// Задание 23
// Создайте массив arr. Удалите все элементы из массива кроме первого и второго. Все удаленные элементы выведите в консоль.
// Например:

// let arr = [1, 2, 3, 4, 5]
// Вывод:

// [3, 4, 5]

// Задание 24
// Создайте массив arr. С помощью метода slice запишите в массив arr2 последние 2 элемента. Выведите arr2 в консоль. Например:
// let arr = [1, 2, 3, 4, 5]
// Вывод:

// [4, 5]

// Задание 1.
// Создайте переменную arr и присвойте массив со строками. Напишите код, который переписывает первые буквы строк массива верхним регистром. Вы должны вывести новый массив в переменной newArr в console.log()

// Пример ввода:

//  ["programming","code","javascript","react"]
// Пример вывода:

//  ["Programming","Code","Javascript","React"]

//  Задание 2
// Создайте массив arr. Напишите код, который добавляет в конец данного массива первый элемент столько раз, сколько элементов в массиве (длина). Этот массив нужно вывести в console.log

// Подсказка: нужно использовать цикл for

// Пример ввода:

//  ['a','b','c']
// Пример вывода:

//  ['a','b','c','a','a','a']

//  Задание 3
// Создайте переменную str и присвойте ей строковое значение. Ваша программа должна каждую четную по последовательности букву перезаписать верхним регистром. Результат нужно вывести в консоль. Подсказка: нужно использовать метод split().

// Пример ввода:

//  "codingiseasy"
// Пример вывода:

//  "cOdInGiSeAsY"

//  Задание 4
// Создайте два массива в переменные arr1 и arr2. Создайте новый массив с произведениями каждых соответствующих по порядку элементов из двух заданных массивов. Новый массив нужно вывести в console.log.

// К примеру если в arr1:

// [11, 7, 4]
// а в arr2:

// [22, 0, 8]
// Вывод будет :

//  [242, 0, 32]
// так как:

// 11 х 22 = 242

// 7 х 0 = 0

// 4 х 8 = 32

// Задание 5
// Создайте переменные arr1 и arr2. Создайте новый массив, где каждое слово из первого массива слияется с соответствующим по порядку словом второго массива.

// Затем нужно вывести новый массив в console.log

// Например, если в arr1:

// ['Makers','Java','Full']
// а в arr2:

// ['KG', 'Script', 'Stack']
// То вывод будет :

//  ['MakersKG','JavaScript','FullStack']
